// kinpo-morze.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <map>
#include "functions.h"
using namespace std;

/*!Cловарь для хранения данных вида {буква на азбуке Морзе, ее перевод}*/
map <string, char> dict = { {".-", 'А'},{"-...", 'Б'},{".--",'В'},
                                  {"--.", 'Г'},{"-..",'Д'},{".",'Е'},
                                  {"...-",'Ж'},{"--..",'З'},{"..",'И'},
                                  {".---",'Й'},{"-.-",'К'},{".-..",'Л'},
                                  {"--",'М'},{"-.",'Н'},{"---",'О'},
                                  {".--.",'П'},{".-.",'Р'},{"...",'С'},
                                  {"-",'Т'},{".--",'У'},{"..-.",'Ф'},
                                  {"....",'Х'},{"-.-.",'Ц'},{"---.",'Ч'},
                                  {"----",'Ш'},{"--.-",'Щ'},{".--.-.",'Ъ'},
                                  {"-.--",'Ы'},{"-..-",'Ь'},
                                  {"..-..",'Э'},{"..--",'Ю'},{".-.-",'Я'},
                                  {"-----",'0'},{".----",'1'},{"..---",'2'},
                                  {"...--",'3'},{"....-",'4'},{".....",'5'},
                                  {"-....",'6'},{"--...",'7'},{"---..",'8'},
                                  {"----.",'9'} };


int main()
{
}
